## Group by in Pandas

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({'a':['foo','bar','foo','bar','foo','bar','foo','foo']
                  ,'b': ['one','one','two','three','two','two','one','three']
                  , 'c': np.random.randn(8), 'd': np.random.randn(8)})

In [4]:
df

     a      b         c         d
0  foo    one  0.685442 -0.573695
1  bar    one  1.253264 -0.203965
2  foo    two  0.107150 -2.331904
3  bar  three -1.583933  1.827144
4  foo    two -0.259857  1.448990
5  bar    two -0.196060  0.513171
6  foo    one -0.397415 -0.888866
7  foo  three  1.483852 -1.173036

[8 rows x 4 columns]

In [5]:
grouped1 = df.groupby('b')

In [6]:
grouped1.groups

{'one': [0, 1, 6], 'three': [3, 7], 'two': [2, 4, 5]}

In [7]:
s1 = pd.Series([['bar','bar','baz','baz','foo','foo','quix','quix'], 
                ['one','two','one','two','one','two','one','two']])
index = pd.MultiIndex.from_arrays(s1, names = ['first','second'])
df1 = pd.DataFrame({'val': np.random.randn(8)},index = index)

In [8]:
df1

                   val
first second
bar   one     0.323728
      two    -1.267129
baz   one    -0.307610
      two    -0.297858
foo   one     1.645579
      two    -1.405351
quix  one     0.107755
      two     1.429144

[8 rows x 1 columns]

In [9]:
df1.groupby(level='first').groups

{'bar': [('bar', 'one'), ('bar', 'two')],
 'baz': [('baz', 'one'), ('baz', 'two')],
 'foo': [('foo', 'one'), ('foo', 'two')],
 'quix': [('quix', 'one'), ('quix', 'two')]}

In [10]:
test = df1.groupby(level='first')

In [11]:
for name, group in df1.groupby(level = 'second'):
    print name
    print group

one
                   val
first second
bar   one     0.323728
baz   one    -0.307610
foo   one     1.645579
quix  one     0.107755

[4 rows x 1 columns]
two
                   val
first second
bar   two    -1.267129
baz   two    -0.297858
foo   two    -1.405351
quix  two     1.429144

[4 rows x 1 columns]

In [12]:
df1.groupby(level='first').get_group('foo')

                   val
first second
foo   one     1.645579
      two    -1.405351

[2 rows x 1 columns]

In [13]:
df

     a      b         c         d
0  foo    one  0.685442 -0.573695
1  bar    one  1.253264 -0.203965
2  foo    two  0.107150 -2.331904
3  bar  three -1.583933  1.827144
4  foo    two -0.259857  1.448990
5  bar    two -0.196060  0.513171
6  foo    one -0.397415 -0.888866
7  foo  three  1.483852 -1.173036

[8 rows x 4 columns]

In [ ]:
def get_letter(letter):
    if letter.lower() in 'aeiou': return 'Pa'